# Laboratorio 3

### Marianna Flores 20180040

In [1]:
import pandas as pd


## PARTE 2
##### Asesino 1

In [2]:
import sqlite3
con = sqlite3.connect('sql-murder-mystery.db')

In [3]:
query = "SELECT name FROM sqlite_master WHERE type = 'table'"
tables = pd.read_sql(query,con)
tables

                     name
0      crime_scene_report
1         drivers_license
2                  person
3  facebook_event_checkin
4               interview
5      get_fit_now_member
6    get_fit_now_check_in
7                  income
8                solution

In [4]:
query = "SELECT * from crime_scene_report;"
tables = pd.read_sql(query,con)
tables

,date,type,description,city
0,20180115,robbery,A Man Dressed as Spider-Man Is on a Robbery Spree,NYC
1,20180115,murder,Life? Dont talk to me about life.,Albany
2,20180115,murder,"Mama, I killed a man, put a gun against his he...",Reno
3,20180215,murder,REDACTED REDACTED REDACTED,SQL City
4,20180215,murder,Someone killed the guard! He took an arrow to ...,SQL City
...,...,...,...,...
1223,20180430,bribery,\n,Garden Grove
1224,20180430,fraud,‘Why not?’ said the March Hare.\n,Houma
1225,20180430,assault,\n,Fontana
1226,20180501,assault,be NO mistake about it: it was neither more no...,Trenton
1227,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [7]:
query = "SELECT description from crime_scene_report WHERE type = 'murder' AND date = 20180115 AND city = 'SQL City';"
tables = pd.read_sql(query,con)
tables.iloc[0,0]

'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".'

In [8]:
query = "SELECT MAX(address_number), name, license_id, id from person WHERE address_street_name = 'Northwestern Dr';"
tables = pd.read_sql(query,con)
tables

   MAX(address_number)            name  license_id     id
0                 4919  Morty Schapiro      118009  14887

In [10]:
query = "SELECT transcript from interview WHERE person_id = 14887;"
tables = pd.read_sql(query,con)
tables.iloc[0,0]

'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".'

In [9]:
query = "SELECT * from person WHERE address_street_name = 'Franklin Ave' AND name LIKE 'Annabel %';"
tables = pd.read_sql(query,con)
tables

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [11]:
query = "SELECT transcript from interview WHERE person_id = 16371;"
tables = pd.read_sql(query,con)
tables.iloc[0,0]

'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.'

In [12]:
query = "SELECT * from get_fit_now_member WHERE membership_status = 'gold' AND id LIKE '%48Z%';"
tables = pd.read_sql(query,con)
tables

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [13]:
query = "SELECT * from get_fit_now_check_in WHERE check_in_date = 20180109 AND membership_id LIKE '%48Z%';"
tables = pd.read_sql(query,con)
tables

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700

In [14]:
query = "SELECT * from person WHERE name = 'Jeremy Bowers';"
tables = pd.read_sql(query,con)
tables

,id,name,license_id,address_number,address_street_name,ssn
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279

In [15]:
cursor = con.cursor()
sql = "INSERT INTO solution VALUES (1, 'Jeremy Bowers')"
cursor.execute(sql)
con.commit()
var = pd.read_sql("SELECT value FROM solution", con)
var.iloc[0,0]

"Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murderer to find the real villian behind this crime. If you feel especially confident in your SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer."


##### Asesino 2

In [16]:
query = "SELECT transcript from interview WHERE person_id = 67318;"
tables = pd.read_sql(query,con)
tables.iloc[0,0]

'I was hired by a woman with a lot of money. I don\'t know her name but I know she\'s around 5\'5" (65") or 5\'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n'

In [17]:
query = "SELECT * from drivers_license WHERE hair_color='red' AND car_make = 'Tesla';"
tables = pd.read_sql(query,con)
tables

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,202298,68,66,green,red,female,500123,Tesla,Model S
1,291182,65,66,blue,red,female,08CM64,Tesla,Model S
2,736081,79,69,brown,red,male,GCAQ6Y,Tesla,Model S
3,918773,48,65,black,red,female,917UU3,Tesla,Model S

In [24]:
query = "SELECT person_id, COUNT(*) from facebook_event_checkin WHERE event_name = 'SQL Symphony Concert' AND date LIKE '201712%' GROUP BY person_id HAVING COUNT(*) == 3"
tables = pd.read_sql(query,con)
tables

   person_id  COUNT(*)
0      24556         3
1      99716         3

In [18]:
query = "SELECT * from person where id = 99716"
tables = pd.read_sql(query,con)
tables

,id,name,license_id,address_number,address_street_name,ssn
0,99716,Miranda Priestly,202298,1883,Golden Ave,987756388

In [19]:
query = "SELECT * FROM income WHERE ssn = 987756388"
tables = pd.read_sql(query,con)
tables

         ssn  annual_income
0  987756388         310000

In [25]:
cursor = con.cursor()
sql = "INSERT INTO solution VALUES (1, 'Miranda Priestly')"
cursor.execute(sql)
con.commit()
var = pd.read_sql("SELECT value FROM solution", con)
var.iloc[0,0]

'Congrats, you found the brains behind the murder! Everyone in SQL City hails you as the greatest SQL detective of all time. Time to break out the champagne!'